const win = window as any;

export const languages = {
    languages: {
        ru: "Русский",
        uk: "Українська",
        en: "English",
        zh: "简体中文 (AI)"
    },
    label_text: {
        gamename: "РОЗЛОМ СТРОЮ",
        autorsname: "Автори",
        audioname: "Звуки\\Музика",
        autorstxt: "Ідея, дизайн, програмування, анімації, ефекти та ін.\n\nА. і Т. Натальчишини",
        audiotxt: "MattRuthSound\nMateusz_Chenc\ndermotte\nJoelAudio\nmarb7e\nlsprice\nMrOwn1\nSDLx\nThalamus_Lab\niainmccurdy\nInspectorJ\nbendodge\nzimbot\nCGEffex\nsteveygos93\nBenboncan\nERH\ndatasoundsample\nsandyrb\nhykenfreak\ntwisterman\nEminYILDIRIM\nhumanoide9000\nAshot Danielyan\nWilliam_King\nStudioKolomna\nGioeleFazzeri\nLesfm\nVitalii Korol\nSergePavkinMusic\nCarlosCarty",
        editorcaption: "Ігровий двигун",
        editortxt: "Cocos Creator",
        mapgeneratorcaption: "Генератор карти",
        mapgeneratortxt: "Perilous shores (watabou)",
        music: "Музика",
        sound: "Звук",
        language: "Мова",
        startturnmsgplayer: "Твій хід",
        startturnmsgenemy: "Хід противника",
        tapanywhere: "Натисни на екран",
        reward: "Нагорода",
        selectreward: "Зроби вибір",
        description: "Опис",
        exit: "Вихід",
        replay: "Переграти",
        win: "Перемога",
        lose: "Поразка",
        continue: "Продовжити",
        start: "Старт",
        settings: "Налаштування",
        about: "Про гру",
        back: "Назад",
        reset: "Скидання гри",
        resetCheckCaption: "Ви хочете скинути гру?",
        resetFinal: "Дані гри скинуті!",
        resetCheckCaution: "Скидання гри призведе до втрати всього прогресу. Гру доведеться проходити заново. Якщо ви дійсно хочете зробити скидання, натисніть кнопку 'Скидання гри'!"
    },
    tutor_text: {
        tutorial: "Навчання",
        yourhero: "Це твій герой",
        yourlife: "Твоє життя",
        enemyhero: "Твій противник",
        yourarmy: "Ці плитки - твої воїни",
        enemyarmy: "Військо противника",
        gameaim: "Мета гри:\nНеобхідно перемогти ворога,\nзменшивши його життя до нуля",
        gamehow: "Як?\nПотрібно довести твої\nвійська до героя противника,\nзнищуючи однотипні плитки\nсуперника, що прилягають\nодин до одного по вертикалі\nта горизонталі",
        tap: "Натисни на плитки\nзнищ супротивника",
        crystalon: "Кристал сигналізує про атаку. Наприкінці ходу герой отримає шкоду.\n\nЧим більше кристалів горить,\nтим більша шкода",
        totem: "Знищ групу плиток\nпоруч з тотемом.\nТаким способом можна\nзнищувати і інші спец.\nплитки",
        endtutor: "Переможи супротивника!",
        thisisyourcard: "Вибери карту магії",
        applycard: "Вибери воїна супротивника\nдля атаки магією",
        aboutcard: "Якщо затиснути карту,\nвідкриється її опис\n\nОпис карт супротивника\nможна подивитися, натиснувши\nна його героя",
        endtutor2: "А тепер, закінчи бій!",
        totor3p1: "Це монах\n\nРаз за хід він просувається на одну клітинку",
        totor3p2: "Табличка показує залишилися монахів",
        totor3p3: "Потрібно провести монахів до кінця поля\n\nЯкщо загине 50%, ти програєш!"
    },
    scrolls: {
        intro: {
            name: "Вступ",
            image: "rezkarIntro",
            text: "Фритріс — світ, який населяють звіролюди. На різних континентах, серед морів і високих гір ведуть вони свої справи, будують королівства, б'ються за землі і торгують. Загалом, усе йшло своїм ходом у світі Фритріс.\n\n" +
                "Поки одного разу неймовірна низка подій не зламала розмірене протікання життя і не поставила всю цивілізацію на край згубної прірви.\n\n" +
                "У підніжжя древніх гір, у далекому королівстві Дальмир, на кордоні земель, по пилюжній сільській дорозі йшов загін найманців…"
        },
        ending: {
            name: "Фінал",
            image: "rezkarEnding2",
            text: "На троні, темному і липкому від крові, сидить новий король. Він дивиться на порожні зали палацу, порожні вулиці міста, на порожні землі і порожнечу всередині себе. А поруч, поклавши долоню на плече Резкара, радісно і задоволено хихикало Зло, вже не ховаючись у надрах старовинної дивної речі з зруйнованого монастиря."
        },
    },
    levels: {
        lvl1: {
            num: "1",
            name: "Перша сутичка",
            intro: "Резкар, могутній ящір-найманець, з загоном прибуває до тихого села, де дізнається, що його жителі страждають від набігів бандитів. Сільський голова не пошкодував монет і швидко переконав найманців стати на захист поселення. На заході сонця, під криваво-червоними хмарами, розгорівся бій, з темними фігурами грабіжників зіткнулася сталь найманців.",
            ending: "Коли останній грабіжник упав, вдячні жителі запросили відсвяткувати і підняти келихи за перемогу. Під час випивки до Резкара підсідає купець і просить супроводити його до Форкара. «Останнім часом в окрузі з'явилося багато лихих людей, схоже якась невідома сила манить їх у ці краї» - каже торговець.",
        },
        lvl2: {
            num: "2",
            name: "Караван",
            intro: "Через село до портового міста Форкар пролягає тракт, останнім часом неспокійний. Група найманців береться супроводжувати купецький караван через небезпечні землі.\n\n" +
                "На півдорозі, чуючи багату здобич, банда розбійників нападає з засідки. Резкар піднімає руку, посилаючи загону знак зайняти оборону.",
            ending: "Рятуючись втечею ворогів, найманці наздогнали їх у лісі біля бандитського табору. Серед речей і зброї, на пеньку, самотньо сидів монах, закутий в кайдани.\n\n" +
                "«Мене звати Шолох і я вдячний вам за своє звільнення», — мовив він, коли найманець розбив кайдани. Монаха взяли з собою до міста, де його чекав корабель і брати по вірі.\n\n" +
                "Коли караван доставив вантаж, купець відсипав пару монет у руку Резкара і задоволений пішов.\n\n" +
                "«Ти ж бачив як ми спілкуємося з розбійниками!» — перерахувавши монети, окликнув торговця Резкар.",
        },
        lvl3: {
            num: "3",
            name: "Підла помста",
            intro: "Скупому купцеві довелося виплатити домовлену вартість повністю, тільки тоді Резкар випустив його з міцних обіймів. Торговець не забув образи і, прагнучи помститися за приниження, висунув звинувачення в нападі на каравани, чим уміло оббрехав ящера перед міською Радою.\n\n" +
                "Загін охоронців за наказом Ради атакує найманців. Бій у вузьких вулицях міста стане важким випробуванням...",
            ending: "Найманці проривалися до рятівних міських воріт, але не витримали опору охорони, яка відтіснила їх назад. Розгублені найманці не знали, як вибратися з пастки.\n\n" +
                "Раптом з'явився Шолох: «Слідуйте за мною на мій корабель!», — сказав монах і вказав рукою у напрямку порту.\n\n" +
                "Загін з боями проривається до порту і піднімається на корабель. Воїнам Резкара доводиться рятуватися втечею від невиправданої та жорстокої люті охорони.",
        },
        lvl4: {
            num: "4",
            name: "Морський бій",
            intro: "Найманці відплили на кораблі, але так і не отримали бажаного порятунку. З-за горизонту, напереріз їм, мчав фрегат з чорним прапором. Пірати швидко наздоганяють корабель Резкара і беруть на абордаж.\n\n" +
                "«Та вашу ж... Дайте сталі просохнути!» - вилаявся ящір, оголюючи зброю.",
            ending: "У морському бою загинуло багато воїнів. Корабель уцілів у бою і після нелегкого плавання причалив до пристані. Місто, до якого прибув загін, називалося Кронбрі.\n\n" +
                "Монахи тепло попрощалися з найманцями і вирушили на північний захід, де вдалині піднімалися до неба гірські хребти. А для досвідчених воїнів Резкара у великому місті завжди знайдеться робота.",
        },
        lvl5: {
            num: "5",
            name: "Скарби давнини",
            intro: "У першій же портовій таверні, куди заглянув Резкар, йшов набір добровольців у армію місцевого Лорда. Несподівана загроза нависла над цими землями, велика орда спустилася з гір і швидко рухалася до міста, знищуючи все на своєму шляху. Кронбрі готувався до важкої облоги. Резкару ж влада наказала зробити рейд у гори і знайти джерело нашестя.\n\n" +
                "Невдовзі найманці опинилися під стінами древнього монастиря, де ховався вождь орди. Резкар одразу відчув важку ауру, яка тяглася шлейфом до цього місця. Загін проник за стіни під покровом темряви і раптовою атакою обрушився на ворогів...",
            ingame: "Не тільки Резкар прагнув потрапити до монастиря, вже кілька днів Шолох з монахами перебував поруч у надії проникнути в колись свій дім.\n\n" +
                "Монахи скористалися моментом, коли найманці відволікли охорону...",
            ending: "Найманці захопили противника зненацька і розгромили його. На подив Резкара, хтось продовжував битися в храмі. Загін увійшов всередину і побачив тіла монахів. Посеред залу стояв вождь, його рука тримала меч, по рукоять вонзений в тіло Шолоха. Той, своєю чергою, схопив ланцюжок на грудях вождя і тягнув з такою силою, ніби в стискаємому руками предметі укладався весь сенс життя святого.\n\n" +
                "Резкар помітив шевеління губ монаха, який читав заклинання. Магія вибухнула між противниками, їх тіла розлетілися і розбилися об кам'яні стіни.\n" +
                "Найманці обшукали приміщення і помітили таємний лаз, яким, ймовірно, і скористалися монахи.",
        },
        lvl6: {
            num: "6",
            name: "Міст",
            intro: "Резкар продовжував служити Лорду, виконуючи найнебезпечніші накази. Завоювавши його прихильність, він став одним з генералів Кронбрі. Його слава росла, від нього йшла зловісна, але приваблива аура, і він швидко став прославленим героєм в очах воїнів і простих жителів. Кожного разу, закінчуючи битву рішучою перемогою, Резкар відчував у собі все більше могутності. Зростала й його армія.\n\n" +
                "Лорд, відчуваючи незвичайну силу у своїх руках, вирішив зазіхнути на владу в усьому королівстві Дальмір і віддав наказ атакувати гарнізон Короля на мосту по дорозі до столиці.",
            ending: "Б'ючись на вузькому переході, Резкар відчував легкість у рухах і без жалю рубав воїнів, які обороняли переправу. Міст було захоплено.\n\n" +
                "У таборі на протилежному березі, в наметі Лорда, засідав військовий рада. Резкар сидів у кріслі і уважно вивчав маленьке темне зернятко всередині свого амулета. Він згадував, що востаннє бачив темряву в кристалі, коли взяв його з нерухомих рук монаха, який так відчайдушно бився за цю річ у похмурих гірських залах. Тоді Резкар вирішив зберегти її на згадку про доблесть Шолоха.",
        },
        lvl7: {
            num: "7",
            name: "Генеральна битва",
            intro: "«Що це?» - запитав Лорд, потягнувшись до амулета. В момент, коли пухка рука доторкнулася до предмета на долоні Резкара, різким змахом меча колишній найманець обірвав життя свого повелителя.\n\n" +
                "«Не смій» - встигла майнути гнівна думка. Присутні не видали ні звуку, заціпеніли, приковані могутньою волею ящера.\n\n" +
                "...І ось, на безкрайньому осінньому полі Резкар зустрів розгорнуту в усі знамена армію короля. Командуючи цілим військом, ящер вже забував, що колись був звичайним найманцем.",
            ending: "Король відступив. Змішаний запах смерті і палаючих полів наповнює повітря. Глибоко вдихаючи його гіркий смак, Резкар мимоволі посміхнувся, відчуваючи задоволення від звершеного. Хоча перемога була за ящером, він вже не міг зупинитися і розумів, що кінець настане лише з загибеллю короля.",
        },
        lvl8: {
            num: "8",
            name: "Брешь у стінах",
            intro: "Армія Резкара стягувала полки до древнього міста Мірдан — столиці королівства. Стіни, прикрашені віковим різьбленням і фресками, виростали перед ними, перегороджуючи шлях.\n\n" +
                "Резкар відчував, як під впливом набутої реліквії його розум занурюється в темряву і безумство. Але натомість, з цієї темряви, він черпав несамовиту силу. Могутнім рухом ящер ударив лапою по землі, спрямовуючи енергію до міста. Повітря завібрувало від сили, хвиля пройшла по землі і місто здригнулося. Кам'яна кладка, здавалося монолітних стін, не витримала і впала, створивши величезну брешь. Війська ринулися на штурм...",
            ending: "Наче одержимі, солдати Резкара рухалися вулицями міста, залишаючи за собою лише руйнування. Не знаючи втоми і не відчуваючи жалю, колишній найманець ішов попереду всіх.\n\n" +
                "Битва тривала до світанку. Коли перші промені сонця осяяли спустошені вулиці, Резкар стояв на центральній площі, оточений своїми воїнами.",
        },
        lvl9: {
            num: "9",
            name: "Остання надія",
            intro: "Залишки гарнізону і озброєні жителі Мірдана зібралися на протилежному краю площі. У їх серцях горіла іскра останньої надії і віра, що навіть проти безумної сили Резкара у них є шанс. З криками боротьби і молитвами вони стійко зустріли ворога. І хоча Резкар, поглинений могутністю артефакта, продовжував свій шлях руйнування, героїчний дух захисників Мірдана змусив його серце на мить стрепенутися перед їх стійкістю і мужністю.",
            ending: "Міська площа, раніше — місце радості і веселощів, стала ареною трагедії. Мертве місто...\n\n" +
                "Останні істерзані залишки війська Резкара рухалися до замку короля. Їх залишалося занадто мало, вони були вкриті кров'ю, потом і брудом, але повні тріумфу і злоби.",
        },
        lvl10: {
            num: "10",
            name: "Корона чия?",
            intro: "У самому серці фортеці, під склепінням древнього замку, розгорілася остання битва. Резкар, разом з вірними йому воїнами, зіткнувся з особистою гвардією великого правителя. Ехо сталевого гуркоту і стогони поранених заповнили зали.\n\n" +
                "Володар чув наближаючий гул сутички і міцніше стискав жезл влади. Готовий захищати свій трон до останнього подиху, він знав, що кожен момент може стати вирішальним у цій битві за долю королівства.",
            ending: "Король, змучений, але непохитний, зустрів Резкара віч-на-віч. Клинки схрестилися з оглушливим дзвоном. З кожним ударом Резкар все сильніше тіснив короля, поки нарешті його клинок не прорвав захист і не встромився в груди правителя. Володар упав на коліна, кров хлинула з рани. Жезл випав з його ослаблих пальців і задзвенів по мармурових плитах тронного залу, упершись у ноги Резкара.\n\n" +
                "Зали замку здригнулися від ликувальних криків: «Перемога!»",
        },
        lvl_arena: {
            num: "...",
            name: "Арена",
            intro: "Бій випадкових бійців з різними здібностями на арені.",
            ending: "",
        }
    },
    cards: {
        meteorRain: {
            name: "Метеоритний дощ",
            description: "На небесному полотні розходяться тріщини, з яких починають падати палаючі уламки космічного походження. Їх удари вибухають, наче вогняні снаряди, залишаючи за собою вихори пилу та вогню.",
            application: "Знищує 15 випадкових плиток ворога."
        },
        champion: {
            name: "Чемпіон",
            description: "Під знаменом короля стоїть легендарний боєць, воїн без міри, втілення сили та руйнівного натиску. Його ім'я — прокляття для ворогів і священне для союзників.",
            application: "Замінює одну випадкову плитку гравця на Чемпіона. Має 2 життя. Знищує 2 плитки ворога, що стоять попереду."
        },
        firewall: {
            name: "Вогняна стіна (Сильна)",
            description: "Повітря густішає, насичуючись терпким запахом сірки, огортає простір і, вмить, спалахує всепоглинаючою вогняною стіною.",
            application: "Спалює 7 плиток у ворожій колонці."
        },
        firewallLow: {
            name: "Вогняна стіна (Слабка)",
            description: "Повітря густішає, насичуючись терпким запахом сірки, огортає простір і, вмить, спалахує всепоглинаючою вогняною стіною.",
            application: "Спалює 3 плитки у ворожій колонці."
        },
        firewallMiddle: {
            name: "Вогняна стіна (Середня)",
            description: "Повітря густішає, насичуючись терпким запахом сірки, огортає простір і, вмить, спалахує всепоглинаючою вогняною стіною.",
            application: "Спалює 5 плиток у ворожій колонці."
        },
        lightning: {
            name: "Блискавка (Сильна)",
            description: "Небо розривається осліплюючим світлом. Блискавки, наче сяючі кинджали богів, розривають простір своїм безжальним танцем.",
            application: "Знищує 11 випадкових клітинок."
        },
        lightningLow: {
            name: "Блискавка (Слабка)",
            description: "Небо розривається осліплюючим світлом. Блискавки, наче сяючі кинджали богів, розривають простір своїм безжальним танцем.",
            application: "Знищує 5 випадкових клітинок."
        },
        lightningMiddle: {
            name: "Блискавка (Середня)",
            description: "Небо розривається осліплюючим світлом. Блискавки, наче сяючі кинджали богів, розривають простір своїм безжальним танцем.",
            application: "Знищує 8 випадкових клітинок."
        },
        totem: {
            name: "Тотем (Сильний)",
            description: "Посеред пагорба височіє різьблений стовп, його поверхня прикрашена таємничими рунами. Наче сторож давніх таємниць, він непохитно споглядає крізь часи.",
            application: "Замінює 2 випадкові плитки гравця на тотеми. Тотеми мають 2 життя."
        },
        totemLow: {
            name: "Тотем (Слабкий)",
            description: "Посеред пагорба височіє різьблений стовп, його поверхня прикрашена таємничими рунами. Наче сторож давніх таємниць, він непохитно споглядає крізь часи.",
            application: "Замінює 2 випадкові плитки гравця на тотеми."
        },
        mine: {
            name: "Міна (Сильна)",
            description: "Пустельна рівнина оманливо спокійна, але в її серці прихована смертельна пастка. Земля раптово здіймається, викидаючи вогонь і металевий запах.",
            application: "Міна ставиться в обране місце на полі ворога і вибухає після ходу супротивника, знищуючи 5 ворожих плиток."
        },
        mineLow: {
            name: "Міна (Слабка)",
            description: "Пустельна рівнина оманливо спокійна, але в її серці прихована смертельна пастка. Земля раптово здіймається, викидаючи вогонь і металевий запах.",
            application: "Міна ставиться в обране місце на полі ворога і вибухає після ходу супротивника, знищуючи 3 ворожі плитки в стовпці."
        },
        meteorite: {
            name: "Метеорит (Сильний)",
            description: "Небеса розколюються, коли вогняний метеорит вривається в атмосферу, залишаючи за собою сяючий слід і передчуття неминучої катастрофи.",
            application: "Знищує 9 ворожих плиток."
        },
        meteoriteLow: {
            name: "Метеорит (Слабкий)",
            description: "Небеса розколюються, коли вогняний метеорит вривається в атмосферу, залишаючи за собою сяючий слід і передчуття неминучої катастрофи.",
            application: "Знищує одну плитку ворога."
        },
        meteoriteMiddle: {
            name: "Метеорит (Середній)",
            description: "Небеса розколюються, коли вогняний метеорит вривається в атмосферу, залишаючи за собою сяючий слід і передчуття неминучої катастрофи.",
            application: "Знищує 5 ворожих плиток."
        },
        recruit: {
            name: "",
            description: "",
            application: ""
        },
        catapult: {
            name: "Баліста (Сильна)",
            description: "На пагорбі височіє масивна баліста, дерев'яні важелі напружені, канати натягнуті до межі, лише мить до смертоносного польоту.",
            application: "Баліста замінює обрану плитку на полі гравця. Кожного разу, при завершенні ходу противника, баліста віднімає 5 од. життя у ворожого героя."
        },
        catapultLow: {
            name: "Баліста (Слабка)",
            description: "На пагорбі височіє масивна баліста, дерев'яні важелі напружені, канати натягнуті до межі, лише мить до смертоносного польоту.",
            application: "Баліста замінює вказану плитку на полі гравця. Кожного разу, при завершенні ходу противника, баліста віднімає 3 од. життя у ворожого героя."
        },
        shaman: {
            name: "Шаман (Сильний)",
            description: "Методичний бій бубна і глибокий гортанний спів закликають сили природи і тіні давніх духів. В очах шамана відображається безкрайня могутність лісу і стає інгредієнтом у його великій цілющій сутності.",
            application: "Шаман замінює обрану плитку на полі гравця. Кожного разу, при завершенні ходу противника, шаман підвищує на 5 од. здоров'я свого героя."
        },
        shamanLow: {
            name: "Шаман (Слабкий)",
            description: "Методичний бій бубна і глибокий горловий наспів закликають сили природи і тіні древніх духів. В очах шамана відображається безкрайня міць лісу і стає інгредієнтом у його великій цілющій сутності.",
            application: "Шаман замінює вибрану плитку на полі гравця. Кожного разу, при завершенні ходу противника, шаман підвищує на 3 од. здоров'я свого героя.",
        },
        c_attack: {
            name: "Контратака",
            description: "Ті, хто був на межі загибелі, хто втратив останню надію, раптом надихаються і, зібравши рештки сил, відкидають ворога, коли між рядами розноситься величний клич Героя.",
            application: "У 3-х випадкових колонках знищується по 3 ворожі плитки.",
        },
        worm: {
            name: "Черв'як (Сильний)",
            description: "Земля тремтить і тріскається, ознака насувається лиха. З бездонних глибин повстає Черв'як. Він невідворотно пожирає ряди військ противника. Крики і стогони поглинутих ворогів довго не вщухають під землею, відлуння тимчасово вгамованого, але вічно голодного звіра.",
            application: "Знищує до 8 ворожих плиток одну за одною.",
        },
        wormMiddle: {
            name: "Черв'як (Середній)",
            description: "Земля тремтить і тріскається, ознака насувається лиха. З бездонних глибин повстає Черв'як. Він невідворотно пожирає ряди військ противника. Крики і стогони поглинутих ворогів довго не вщухають під землею, відлуння тимчасово вгамованого, але вічно голодного звіра.",
            application: "Знищує до 6 ворожих плиток одну за одною.",
        },
        wormLow: {
            name: "Черв'як (Слабкий)",
            description: "Земля тремтить і тріскається, ознака насувається лиха. З бездонних глибин повстає Черв'як. Він невідворотно пожирає ряди військ противника. Крики і стогони поглинутих ворогів довго не вщухають під землею, відлуння тимчасово вгамованого, але вічно голодного звіра.",
            application: "Знищує до 4 ворожих плиток одну за одною.",
        },
        pike: {
            name: "Спис Бога (Сильний)",
            description: "Могутня зброя, що випромінює яскраве світло божественної енергії. Його наконечник пронизує ряди ворогів з невідворотною точністю, залишаючи за собою лише попіл.",
            application: "Знищує 9 ворожих плиток.",
        },
        pikeLow: {
            name: "Спис Бога (Слабкий)",
            description: "Могутня зброя, що випромінює яскраве світло божественної енергії. Його наконечник пронизує ряди ворогів з невідворотною точністю, залишаючи за собою лише попіл.",
            application: "Знищує 3 ворожі плитки.",
        },
        pikeMiddle: {
            name: "Спис Бога (Середній)",
            description: "Могутня зброя, що випромінює яскраве світло божественної енергії. Його наконечник пронизує ряди ворогів з невідворотною точністю, залишаючи за собою лише попіл.",
            application: "Знищує 5 ворожих плиток.",
        },
        push: {
            name: "Натиск",
            description: "Армія готується до атаки, мечі мерехтять, щити стикаються, а в очах солдат горить полум'я рішучості. В цей момент, звучить бойовий ріг.",
            application: "Знищується задній ворожий ряд.",
        },
        berserk: {
            name: "Берсерк (Сильний)",
            description: "В самому центрі битви з'являється воїн, охоплений люттю. В його очах дика пристрасть, а кожен його удар - невтримна лють.",
            application: "На полі гравця випадковим чином з'являються 2 берсерки, замінюючи 2 плитки. Кожен хід атакують плитки ворога.",
        },
        berserkLow: {
            name: "Берсерк (Слабкий)",
            description: "В самому центрі битви з'являється воїн, охоплений люттю. В його очах дика пристрасть, а кожен його удар - невтримна лють.",
            application: "На полі гравця випадковим чином з'являється 1 берсерк, замінюючи дружню плитку. Кожен хід атакує плитку ворога.",
        },
        assassin: {
            name: "Асасин (Сильний)",
            description: "Безшумно, непомітний оку, він наближається до мети, наче тінь в пітьмі ночі, передвістя неминучого.",
            application: "Замінює вибрану плитку на полі гравця на асасина. В кінці ходу противника, асасин знищує 2 випадкові плитки ворога.",
        },
        assassinLow: {
            name: "Асасин (Слабкий)",
            description: "Безшумно, непомітний оку, він наближається до мети, наче тінь в пітьмі ночі, передвістя неминучого.",
            application: "Замінює вибрану плитку на полі гравця на асасина. В кінці ходу противника, асасин знищує випадкову плитку ворога.",
        },
        shield: {
            name: "Щит",
            description: "Солдати вишикуються в броньовану позицію, виставляючи щити і настовбурчившись списами, готові відбити будь-яку атаку.",
            application: "Група вибраних клітинок отримує недоторканність до наступного ходу гравця.",
        },
        hammer: {
            name: "Молот Бога (Сильний)",
            description: "На арені великих битв піднімається Молот Бога, його руйнівні удари вибухають розкатами грози, а земля розривається під натиском древньої сили.",
            application: "Знищує 9 ворожих плиток.",
        },
        hammerLow: {
            name: "Молот Бога (Слабкий)",
            description: "На арені великих битв піднімається Молот Бога, його руйнівні удари вибухають розкатами грози, а земля розривається під натиском древньої сили.",
            application: "Знищує 3 ворожі плитки.",
        },
        hammerMiddle: {
            name: "Молот Бога (Середній)",
            description: "На арені великих битв піднімається Молот Бога, його руйнівні удари вибухають розкатами грози, а земля розривається під натиском древньої сили.",
            application: "Знищує 6 ворожих плиток.",
        },
        maneuver: {
            name: "Маневр",
            description: "Хмари пилу піднімаються серед поля битви, армія стрімко перебудовується, наче живий організм, що підкоряється невидимим наказам досвідченого командира.",
            application: "Перемішує поле навколо цільової плитки.",
        },
        panic: {
            name: "Паніка",
            description: "Незбагненний страх поступово прокрадається серед ворожих рядів. Крики жаху зливаються в безлику масу, наче прокляття. В цей момент війська втрачають рештки стійкості.",
            application: "Плитки поруч з цільовою отримують той самий тип.",
        }
    }
}

if (!win.languages) {
    win.languages = {};
}

win.languages.uk = languages;
